GopalSaraf/Practicals/PSDL/include/proc/pic12lf1840t48a.inc
// Register: CCP1AS
#define CCP1AS CCP1AS
CCP1AS                                   equ 0295h
// bitfield definitions
CCP1AS_PSS1BD0_POSN                      equ 0000h
CCP1AS_PSS1BD0_POSITION                  equ 0000h
CCP1AS_PSS1BD0_SIZE                      equ 0001h
CCP1AS_PSS1BD0_LENGTH                    equ 0001h
CCP1AS_PSS1BD0_MASK                      equ 0001h
CCP1AS_PSS1BD1_POSN                      equ 0001h
CCP1AS_PSS1BD1_POSITION                  equ 0001h
CCP1AS_PSS1BD1_SIZE                      equ 0001h
CCP1AS_PSS1BD1_LENGTH                    equ 0001h
CCP1AS_PSS1BD1_MASK                      equ 0002h
CCP1AS_PSS1AC0_POSN                      equ 0002h
CCP1AS_PSS1AC0_POSITION                  equ 0002h
CCP1AS_PSS1AC0_SIZE                      equ 0001h
CCP1AS_PSS1AC0_LENGTH                    equ 0001h
CCP1AS_PSS1AC0_MASK                      equ 0004h
CCP1AS_PSS1AC1_POSN                      equ 0003h
CCP1AS_PSS1AC1_POSITION                  equ 0003h
CCP1AS_PSS1AC1_SIZE                      equ 0001h
CCP1AS_PSS1AC1_LENGTH                    equ 0001h
CCP1AS_PSS1AC1_MASK                      equ 0008h
CCP1AS_CCP1AS0_POSN                      equ 0004h
CCP1AS_CCP1AS0_POSITION                  equ 0004h
CCP1AS_CCP1AS0_SIZE                      equ 0001h
CCP1AS_CCP1AS0_LENGTH                    equ 0001h
CCP1AS_CCP1AS0_MASK                      equ 0010h
CCP1AS_CCP1AS1_POSN                      equ 0005h
CCP1AS_CCP1AS1_POSITION                  equ 0005h
CCP1AS_CCP1AS1_SIZE                      equ 0001h
CCP1AS_CCP1AS1_LENGTH                    equ 0001h
CCP1AS_CCP1AS1_MASK                      equ 0020h
CCP1AS_CCP1AS2_POSN                      equ 0006h
CCP1AS_CCP1AS2_POSITION                  equ 0006h
CCP1AS_CCP1AS2_SIZE                      equ 0001h
CCP1AS_CCP1AS2_LENGTH                    equ 0001h
CCP1AS_CCP1AS2_MASK                      equ 0040h
CCP1AS_CCP1ASE_POSN                      equ 0007h
CCP1AS_CCP1ASE_POSITION                  equ 0007h
CCP1AS_CCP1ASE_SIZE                      equ 0001h
CCP1AS_CCP1ASE_LENGTH                    equ 0001h
CCP1AS_CCP1ASE_MASK                      equ 0080h
CCP1AS_PSS1BD_POSN                       equ 0000h
CCP1AS_PSS1BD_POSITION                   equ 0000h
CCP1AS_PSS1BD_SIZE                       equ 0002h
CCP1AS_PSS1BD_LENGTH                     equ 0002h
CCP1AS_PSS1BD_MASK                       equ 0003h
CCP1AS_PSS1AC_POSN                       equ 0002h
CCP1AS_PSS1AC_POSITION                   equ 0002h
CCP1AS_PSS1AC_SIZE                       equ 0002h
CCP1AS_PSS1AC_LENGTH                     equ 0002h
CCP1AS_PSS1AC_MASK                       equ 000Ch
CCP1AS_CCP1AS_POSN                       equ 0004h
CCP1AS_CCP1AS_POSITION                   equ 0004h
CCP1AS_CCP1AS_SIZE                       equ 0003h
CCP1AS_CCP1AS_LENGTH                     equ 0003h
CCP1AS_CCP1AS_MASK                       equ 0070h

// Register: PSTR1CON
#define PSTR1CON PSTR1CON
PSTR1CON                                 equ 0296h
// bitfield definitions
PSTR1CON_STR1A_POSN                      equ 0000h
PSTR1CON_STR1A_POSITION                  equ 0000h
PSTR1CON_STR1A_SIZE                      equ 0001h
PSTR1CON_STR1A_LENGTH                    equ 0001h
PSTR1CON_STR1A_MASK                      equ 0001h
PSTR1CON_STR1B_POSN                      equ 0001h
PSTR1CON_STR1B_POSITION                  equ 0001h
PSTR1CON_STR1B_SIZE                      equ 0001h
PSTR1CON_STR1B_LENGTH                    equ 0001h
PSTR1CON_STR1B_MASK                      equ 0002h
PSTR1CON_STR1SYNC_POSN                   equ 0004h
PSTR1CON_STR1SYNC_POSITION               equ 0004h
PSTR1CON_STR1SYNC_SIZE                   equ 0001h
PSTR1CON_STR1SYNC_LENGTH                 equ 0001h
PSTR1CON_STR1SYNC_MASK                   equ 0010h

// Register: IOCAP
#define IOCAP IOCAP
IOCAP                                    equ 0391h
// bitfield definitions
IOCAP_IOCAP0_POSN                        equ 0000h
IOCAP_IOCAP0_POSITION                    equ 0000h
IOCAP_IOCAP0_SIZE                        equ 0001h
IOCAP_IOCAP0_LENGTH                      equ 0001h
IOCAP_IOCAP0_MASK                        equ 0001h
IOCAP_IOCAP1_POSN                        equ 0001h
IOCAP_IOCAP1_POSITION                    equ 0001h
IOCAP_IOCAP1_SIZE                        equ 0001h
IOCAP_IOCAP1_LENGTH                      equ 0001h
IOCAP_IOCAP1_MASK                        equ 0002h
IOCAP_IOCAP2_POSN                        equ 0002h
IOCAP_IOCAP2_POSITION                    equ 0002h
IOCAP_IOCAP2_SIZE                        equ 0001h
IOCAP_IOCAP2_LENGTH                      equ 0001h
IOCAP_IOCAP2_MASK                        equ 0004h
IOCAP_IOCAP3_POSN                        equ 0003h
IOCAP_IOCAP3_POSITION                    equ 0003h
IOCAP_IOCAP3_SIZE                        equ 0001h
IOCAP_IOCAP3_LENGTH                      equ 0001h
IOCAP_IOCAP3_MASK                        equ 0008h
IOCAP_IOCAP4_POSN                        equ 0004h
IOCAP_IOCAP4_POSITION                    equ 0004h
IOCAP_IOCAP4_SIZE                        equ 0001h
IOCAP_IOCAP4_LENGTH                      equ 0001h
IOCAP_IOCAP4_MASK                        equ 0010h
IOCAP_IOCAP5_POSN                        equ 0005h
IOCAP_IOCAP5_POSITION                    equ 0005h
IOCAP_IOCAP5_SIZE                        equ 0001h
IOCAP_IOCAP5_LENGTH                      equ 0001h
IOCAP_IOCAP5_MASK                        equ 0020h
IOCAP_IOCAP_POSN                         equ 0000h
IOCAP_IOCAP_POSITION                     equ 0000h
IOCAP_IOCAP_SIZE                         equ 0006h
IOCAP_IOCAP_LENGTH                       equ 0006h
IOCAP_IOCAP_MASK                         equ 003Fh

// Register: IOCAN
#define IOCAN IOCAN
IOCAN                                    equ 0392h
// bitfield definitions
IOCAN_IOCAN0_POSN                        equ 0000h
IOCAN_IOCAN0_POSITION                    equ 0000h
IOCAN_IOCAN0_SIZE                        equ 0001h
IOCAN_IOCAN0_LENGTH                      equ 0001h
IOCAN_IOCAN0_MASK                        equ 0001h
IOCAN_IOCAN1_POSN                        equ 0001h
IOCAN_IOCAN1_POSITION                    equ 0001h
IOCAN_IOCAN1_SIZE                        equ 0001h
IOCAN_IOCAN1_LENGTH                      equ 0001h
IOCAN_IOCAN1_MASK                        equ 0002h
IOCAN_IOCAN2_POSN                        equ 0002h
IOCAN_IOCAN2_POSITION                    equ 0002h
IOCAN_IOCAN2_SIZE                        equ 0001h
IOCAN_IOCAN2_LENGTH                      equ 0001h
IOCAN_IOCAN2_MASK                        equ 0004h
IOCAN_IOCAN3_POSN                        equ 0003h
IOCAN_IOCAN3_POSITION                    equ 0003h
IOCAN_IOCAN3_SIZE                        equ 0001h
IOCAN_IOCAN3_LENGTH                      equ 0001h
IOCAN_IOCAN3_MASK                        equ 0008h
IOCAN_IOCAN4_POSN                        equ 0004h
IOCAN_IOCAN4_POSITION                    equ 0004h
IOCAN_IOCAN4_SIZE                        equ 0001h
IOCAN_IOCAN4_LENGTH                      equ 0001h
IOCAN_IOCAN4_MASK                        equ 0010h
IOCAN_IOCAN5_POSN                        equ 0005h
IOCAN_IOCAN5_POSITION                    equ 0005h
IOCAN_IOCAN5_SIZE                        equ 0001h
IOCAN_IOCAN5_LENGTH                      equ 0001h
IOCAN_IOCAN5_MASK                        equ 0020h
IOCAN_IOCAN_POSN                         equ 0000h
IOCAN_IOCAN_POSITION                     equ 0000h
IOCAN_IOCAN_SIZE                         equ 0006h
IOCAN_IOCAN_LENGTH                       equ 0006h
IOCAN_IOCAN_MASK                         equ 003Fh

